Tekla.Structures.AnalysisInternal.DotAnalysisArea.analysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.analysisType
The analysis type of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.label
The label of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.material
The material of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.profile
The profile of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.thickness
The thickness of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.rigidDiaphragm
The rigid diaphragm of the analysis area.

Tekla.Structures.AnalysisInternal.DotAnalysisArea.analysisDesignCode
The analysis design code.